/******************************************************************************************
 * FileName     : 04._serial_monitor_print
 * Description  : 시리얼 모니터에 "Hello ETboard!" 출력해 보기
 * Author       : 오경석
 * Created Date : 2023.10.25
 * Reference    :
 * Modified     : 2024.03.13 : PEJ : 파일명, 코드 수정
******************************************************************************************/


// setup
void setup() {
  Serial.begin(115200);                  // 시리얼 통신 속도 설정
}


// main loop
void loop() {
  Serial.println("Hello ETboard!");      // 시리얼 모니터에 "Hello ETboard!" 출력
  delay(1000);                           // 1초 기다리기
}


//==========================================================================================
//                                                    
// (주)한국공학기술연구원 http://et.ketri.re.kr       
//                                                    
//==========================================================================================
