/******************************************************************************************
 * FileName     : Blink_ET_Board.ino
 * Description  : 디지털 명령으로 LED 켜고 끄기
 * Hardware     : ETBoard(이티보드, ESP32 등록 공식 Arduino Board)
 * Author       : 한국공학기술연구원(KETRI)
 * Created Date : 2022.04.21
 * Reference    : 
 * Modified     : 2022.04.21 : LEH : 헤더 수정, 소스 크린징
******************************************************************************************/

void setup() {
   pinMode(D2, OUTPUT);   // D2를 LED 출력모드 설정
}

void loop() {
  digitalWrite(D2, HIGH); // LED를 켬
  delay(1000);            // 1초 기다림
  digitalWrite(D2, LOW);  // LED를 끔
  delay(1000);            // 1초 기다림
  }

//==========================================================================================
//                                                    
// (주)한국공학기술연구원 http://et.ketri.re.kr       
//                                                    
//==========================================================================================
