 /******************************************************************************************
 * FileName     : Blink_ET_Board_EX.ino
 * Description  : LED를 1초에 5번 깜빡이게 하기
 * Hardware     : ETBoard(이티보드, ESP32 등록 공식 Arduino Board)
 * Author       : 한국공학기술연구원(KETRI)
 * Created Date : 2022.08.09
 * Reference    : 
 * Modified     : 
******************************************************************************************/

void setup() {
   pinMode(D2, OUTPUT);     // D2를 LED 출력모드 설정
}

void loop() {
  digitalWrite(D2, HIGH);   // LED를 켬
  delay(100);               // 0.1초 기다림
  digitalWrite(D2, LOW);    // LED를 켬
  delay(100);               // 0.1초 기다림
  }

//==========================================================================================
//                                                    
// (주)한국공학기술연구원 http://et.ketri.re.kr       
//                                                    
//==========================================================================================
