 /******************************************************************************************
 * FileName     : AnalogRead_ET_Board_EX.ino
 * Description  : 가변저항에서 조도센서로 바꿔 차이점 확인하기
 * Hardware     : ETBoard(이티보드, ESP32 등록 공식 Arduino Board)
 * Author       : 한국공학기술연구원(KETRI)
 * Created Date : 2022.08.09
 * Reference    : 
 * Modified     : 
******************************************************************************************/

void setup() {
  Serial.begin(115200);
}
 
void loop() {
int sensorValue = analogRead(A1);      // A1에 연결된 조도센서의 값을 저장 
  Serial.println(sensorValue);         // 시리얼 모니터에 조도센서의 값 표시
 
  delay(1);
}

//==========================================================================================
//                                                    
// (주)한국공학기술연구원 http://et.ketri.re.kr       
//                                                    
//==========================================================================================
