/******************************************************************************************
 * FileName     : 01._serial_monitor_print
 * Description  : 시리얼 모니터에 반려동물 이름 출력해 보기
 * Author       : 오경석
 * Created Date : 2023.10.25
 * Reference    :
 * Modified     : 2024.03.27 : PEJ : 코드, 주석 수정
******************************************************************************************/


// setup
void setup() {
  Serial.begin(115200);         // 시리얼 통신 설정
}


// main loop
void loop() {
  Serial.println("pet name");   // 큰따옴표 사이에 반려동물 이름을 작성해 주세요.
  delay(1000);                  // 1초 기다리기
}


//==========================================================================================
//                                                    
// (주)한국공학기술연구원 http://et.ketri.re.kr       
//                                                    
//==========================================================================================
