/******************************************************************************************
 * FileName     : 04._serial_monitor_output
 * Description  : 시리얼 모니터에 "Hello ETboard" 출력해 보기
 * Author       : 오경석
 * Created Date : 2023.10.25
 * Reference    :
 * Modified     :
******************************************************************************************/

void setup() {
  Serial.begin(115200);                  // 시리얼 통신 설정
}

void loop() {
  Serial.println("Hello ETboard");       // 시리얼 모니터에 "Hello ETboard" 출력
  delay(1000);                            // 1초 기다리기
}

//==========================================================================================
//                                                    
// (주)한국공학기술연구원 http://et.ketri.re.kr       
//                                                    
//==========================================================================================
