/******************************************************************************************
 * FileName     : 13._temperature_sensor
 * Description  : 온도 센서 값 출력해 보기
 * Author       : 오경석
 * Created Date : 2023.10.25
 * Reference    :
 * Modified     :
******************************************************************************************/

int sensor = A2;                           // 온도 센서 지정
int sensor_result = 0;                     // 온도 센서 결과 값 설정

void setup() {
  Serial.begin(115200);                    // 시리얼 통신 설정
}

void loop() {
  sensor_result = analogRead(sensor);      // 온도 센서 결과 값 저장
  
  Serial.println(sensor_result);           // 시리얼 모니터에 온도 센서 결과 값 출력
}

//==========================================================================================
//                                                    
// (주)한국공학기술연구원 http://et.ketri.re.kr       
//                                                    
//==========================================================================================
