/******************************************************************************************
 * FileName     : 02._led_red_blink
 * Description  : 빨강 LED 켰다 껐다 해 보기
 * Author       : 오경석
 * Created Date : 2023.10.24
 * Reference    :
 * Question     : delay를 사용하지 않으면 어떻게 될까요?
 * Modified     :
******************************************************************************************/

int led_red = D2;                         // 빨강 LED 지정

void setup() {
  pinMode(led_red, OUTPUT);               // 빨강 LED를 출력으로 설정
}

void loop() {
  digitalWrite(led_red, HIGH);            // 빨강 LED 켜기
  delay(2000);                            // 2초 기다리기
  
  digitalWrite(led_red, LOW);             // 빨강 LED 끄기   
  delay(2000);                            // 2초 기다리기 
}

//==========================================================================================
//                                                    
// (주)한국공학기술연구원 http://et.ketri.re.kr       
//                                                    
//==========================================================================================