/******************************************************************************************
 * FileName     : 02._led_blue_blink.Ex
 * Description  : 파랑 LED 켰다 껐다 해보기
 * Author       : 오경석
 * Created Date : 2023.10.24
 * Reference    :
 * Modified     :
******************************************************************************************/

int led_blue = D3;                       // 파랑 LED 지정

void setup() {
  pinMode(led_blue, OUTPUT);             // 파랑 LED를 출력으로 설정
}

void loop() {
  digitalWrite(led_blue, HIGH);          // 파랑 LED 켜기
  delay(2000);                           // 2초 기다리기
  
  digitalWrite(led_blue, LOW);           // 파랑 LED 끄기
  delay(2000);                           // 2초 기다리기
}

//==========================================================================================
//                                                    
// (주)한국공학기술연구원 http://et.ketri.re.kr       
//                                                    
//==========================================================================================
