/******************************************************************************************
 * FileName     : 01.red_led_turn_on
 * Description  : 빨간색 LED 켜 보기
 * Author       : 오경석
 * Created Date : 2023.10.24
 * Reference    :
 * Modified     :
******************************************************************************************/

int led_red = D2;                       // 빨강 LED 지정

void setup() {
  pinMode(led_red, OUTPUT);             // 빨강 LED를 출력으로 설정
}

void loop() {
  digitalWrite(led_red, HIGH);          // 빨강 LED 켜기
}

//==========================================================================================
//                                                    
// (주)한국공학기술연구원 http://et.ketri.re.kr       
//                                                    
//==========================================================================================
